# Напишите программу, которая по заданному номеру четверти, показывает 
# диапазон возможных координат точек в этой четверти (x и y).
print('Введите номер четверти оси координат: ')
part = int(input())
if part == 1:
    print('x = (0, +...)')
    print('y = (0, +...)')
if part == 2:
    print('x = (-..., 0)')
    print('y = (0, +...)')
if part == 3:
    print('x = (-..., 0)')
    print('y = (-..., 0)')
if part == 4:
    print('x = (0, +...)')
    print('y = (-..., 0)')
